ranma/ESP8266_NONOS_SDK/third_party/relib/main/user_start.c
	efuse[0] = EFUSE->DATA[0];
	efuse[1] = EFUSE->DATA[1];
	efuse[2] = EFUSE->DATA[2];
	efuse[3] = EFUSE->DATA[3];

	mac[3] = efuse[1] >> 8;
	mac[4] = efuse[1];
	mac[5] = efuse[0] >> 24;

	if (efuse[2] & EFUSE_IS_48BITS_MAC) {
		uint8_t tmp_mac[4];

		mac[0] = efuse[3] >> 16;
		mac[1] = efuse[3] >> 8;
		mac[2] = efuse[3];

		use_default = 0;

		tmp_mac[0] = mac[2];
		tmp_mac[1] = mac[1];
		tmp_mac[2] = mac[0];

		efuse_crc = efuse[2] >> 24;
		calc_crc = esp_crc8(tmp_mac, 3);

		if (efuse_crc != calc_crc)
			use_default = 1;

		if (!use_default) {
			version = (efuse[1] >> EFUSE_VERSION_S) & EFUSE_VERSION_V;

			if (version == EFUSE_VERSION_1 || version == EFUSE_VERSION_2) {
				tmp_mac[0] = mac[5];
				tmp_mac[1] = mac[4];
				tmp_mac[2] = mac[3];
				tmp_mac[3] = efuse[1] >> 16;

				efuse_crc = efuse[0] >> 16;
				calc_crc = esp_crc8(tmp_mac, 4);

				if (efuse_crc != calc_crc)
					use_default = 1;
			}
		}
	}

	if (use_default) {
		mac[0] = 0x18;
		mac[1] = 0xFE;
		mac[2] = 0x34;
	}

	return 0;
}

int register_chipv6_phy(esp_init_data_default_st *init_data);
void phy_disable_agc(void);
void ieee80211_phy_init(ieee80211_phymode_t phyMode);
void lmacInit(void);
void wDev_Initialize(void);
void pp_attach(void);
void pp_soft_wdt_init(void);
void ieee80211_ifattach(ieee80211com_st *ic, uint8_t *macaddr);
void wDev_ProcessFiq(void *unused_arg);
void relib_wDev_ProcessFiq(void *unused_arg);
void pm_attach(void);
void fpm_attach(void);
void phy_enable_agc(void);
void cnx_attach(ieee80211com_st *ic);
void wDevEnableRx(void);

void relib_pp_attach(void);

void ICACHE_FLASH_ATTR
chip_init(esp_init_data_default_st *init_data, uint8_t *macaddr)
{
	DPRINTF("chip_init\n");
	if (register_chipv6_phy(init_data) != 0) {
		os_printf_plus("%s %u\n", "mai", 0x130);
		while (1);
	}
#if 0
	uart_div_modify(0, NORMAL_CLK_FREQ / UART_BAUDRATE);
	uart_div_modify(1, NORMAL_CLK_FREQ / UART_BAUDRATE);
#else
	relib_reset_uart_baud(NORMAL_CLK_FREQ);
#endif
	phy_disable_agc();
	ieee80211_phy_init(g_ic.ic_profile.phyMode);
	lmacInit();
	wDev_Initialize();
	relib_pp_attach();
	ieee80211_ifattach(&g_ic, macaddr);
	_xtos_set_interrupt_handler_arg(0, relib_wDev_ProcessFiq, NULL);
	_xtos_ints_on(1);
	pm_attach();
	fpm_attach();
	phy_enable_agc();
	cnx_attach(&g_ic);
	wDevEnableRx();
}

int ICACHE_FLASH_ATTR
flash_data_check(uint8_t *data)
{
	uint32_t sum = 0;
	for (int i = 0; i < 24; i++, data+= 4) {
		sum += data[0] | (data[1]<<8) | (data[2]<<16) | (data[3]<<24);
	}
	sum += ((EFUSE->DATA[2] & 0xF000)<<16) | (EFUSE->DATA[1] & 0xfffffff);
	sum += (EFUSE->DATA[0] & 0xff000000) | (EFUSE->DATA[3] & 0xffffff);
	sum ^= 0xFFFFFFFF;

	uint32_t csum = data[8] | (data[9]<<8) | (data[10]<<16) | (data[11]<<24);
	if (sum != csum) {
		return 1;
	}
	return 0;
}

void
wdt_feed(void *unused_arg)
{
#if 0
	/* Original code fills in rst_info, only to overwrite it using system_rtc_mem_read... */
	rst_info_st rst_info;
	rst_info.exccause = *in_EXCCAUSE;
	rst_info.epc1 = *in_EPC1;
	rst_info.epc2 = *in_EPC2;
	rst_info.epc3 = *in_EPC3;
	rst_info.excvaddr = *in_EXCVADDR;
	rst_info.depc = *in_DEPC;
	system_rtc_mem_read(0, &rst_info, 0x1c);
	RTC->STORE[0] = REASON_WDT_RST;
	rst_info.reason = REASON_WDT_RST;
	system_rtc_mem_write(0, &rst_info, 0x1c);
#else
	rst_info_st *rst_info = (rst_info_st*)&RTCMEM->SYSTEM[0];
	RTC->STORE[0] = REASON_WDT_RST;
	rst_info->reason = REASON_WDT_RST;
#endif
}

void ICACHE_FLASH_ATTR
wdt_init(bool hw_wdt_enable)
{
	if (hw_wdt_enable) {
		WDT->CTL &= ~1;
		ets_isr_attach(8, wdt_feed, 0);
		DPORT->EDGE_INT_ENABLE |= 1;
		WDT->OP = 0xb;
		WDT->OP_ND = 0xd;
		WDT->CTL |= 0x38;
		WDT->CTL &= ~6;
		WDT->CTL |= 1;
		ets_isr_unmask(0x100);
	}
	pp_soft_wdt_init();
}

void wifi_softap_set_default_ssid(void);
void wifi_station_set_default_hostname(uint8_t *mac);
void wDev_Set_Beacon_Int(uint32_t beacon_int);
bool system_param_save_with_protect(uint16_t start_sec, void *param, uint16_t len);

void ICACHE_FLASH_ATTR
user_init_default_profile(void)
{
	bool bVar1;
	uint32_t uVar2;
	
	bVar1 = g_ic.ic_profile.opmode == 0xff;
	if (bVar1) {
		g_ic.ic_profile.opmode = '\x02';
	}
	wifi_softap_set_default_ssid();
	wifi_station_set_default_hostname((char *)info.sta_mac);
	if ((0xd < g_ic.ic_profile.softap.channel) || (g_ic.ic_profile.softap.channel == '\0')) {
		g_ic.ic_profile.softap.channel = '\x01';
	}
	if ((60000 < g_ic.ic_profile.softap_beacon_interval) ||
		 (g_ic.ic_profile.softap_beacon_interval < 100)) {
		g_ic.ic_profile.softap_beacon_interval = 100;
	}
	uVar2 = g_ic.ic_profile.softap_beacon_interval / 100;
	wDev_Set_Beacon_Int((uVar2 & 0xffff) * 0x19000);
	if ((4 < g_ic.ic_profile.softap.authmode) || (g_ic.ic_profile.softap.authmode == '\x01')) {
		g_ic.ic_profile.softap.authmode = '\0';
		bzero(g_ic.ic_profile.softap.password,0x40);
	}
	if (1 < g_ic.ic_profile.softap.ssid_hidden) {
		g_ic.ic_profile.softap.ssid_hidden = '\0';
	}
	if (8 < g_ic.ic_profile.softap.max_connection) {
		g_ic.ic_profile.softap.max_connection = '\x04';
	}
	if (g_ic.ic_profile.sta.ssid.len == -1) {
		bzero(&g_ic.ic_profile.sta,0x24);
		bzero(g_ic.ic_profile.sta.password,0x40);
	}
	g_ic.ic_profile.wps_status = WPS_STATUS_DISABLE;
	g_ic.ic_profile.wps_type = WPS_TYPE_DISABLE;
	g_ic.ic_profile.led.open_flag = '\0';
	if (true < g_ic.ic_profile.sta.bssid_set) {
		g_ic.ic_profile.sta.bssid_set = false;
	}
	if (5 < g_ic.ic_profile.ap_change_param.ap_number) {
		g_ic.ic_profile.ap_change_param.ap_number = '\x01';
	}
	if ((IEEE80211_MODE_11NG < g_ic.ic_profile.phyMode) ||
		 (g_ic.ic_profile.phyMode == IEEE80211_MODE_AUTO)) {
		g_ic.ic_profile.phyMode = IEEE80211_MODE_11NG;
	}
	if (g_ic.ic_profile.minimum_rssi_in_fast_scan == -1) {
		g_ic.ic_profile.minimum_rssi_in_fast_scan = -0x7f;
	}
	if (g_ic.ic_profile.minimum_auth_mode_in_fast_scan == 0xff) {
		g_ic.ic_profile.minimum_auth_mode_in_fast_scan = '\0';
	}
	if (bVar1) {
		system_param_save_with_protect((uint16)system_param_sector_start,&g_ic.ic_profile,0x4a4);
	}
}

#if 1
void ICACHE_FLASH_ATTR
relib_user_local_init(void)
{
	uint8_t bVar1;
	char cVar2;
	bool bVar3;
	uint8_t uVar4;
	int iVar5;
	void *pv;
	uint32_t uVar6;
	phy_init_and_rf_cal_st *phy_rf_data;
	char *rf_cal_data;
	char cVar8;
	char cVar9;

	_xtos_set_exception_handler(9,user_fatal_exception_handler);
	_xtos_set_exception_handler(0,user_fatal_exception_handler);
	_xtos_set_exception_handler(2,user_fatal_exception_handler);
	_xtos_set_exception_handler(3,load_non_32_wide_handler);
	_xtos_set_exception_handler(0x1c,user_fatal_exception_handler);
	_xtos_set_exception_handler(0x1d,user_fatal_exception_handler);
	_xtos_set_exception_handler(8,user_fatal_exception_handler);
	DPRINTF("sleep_reset_analog_rtcreg_8266\n");
	sleep_reset_analog_rtcreg_8266();  /* resets clocks, so re-init uart after */
	relib_reset_uart_baud(BOOT_CLK_FREQ);
	user_pre_init();
	iVar5 = read_macaddr_from_otp(info.sta_mac);
	if (iVar5 == 0) {
		iVar5 = memcmp(info.sta_mac,g_ic.ic_profile.mac_bakup,6);
		if (iVar5 != 0) {
			memcpy(g_ic.ic_profile.mac_bakup,info.sta_mac,6);
			os_printf_plus("Backup\n");
			system_save_sys_param();
		}
	}
	else {
		bVar1 = g_ic.ic_profile.mac_bakup[0] & 1;
		if ((g_ic.ic_profile.mac_bakup[0] & 1) == 0) {
			iVar5 = memcmp(info.sta_mac,g_ic.ic_profile.mac_bakup,6);
			if (iVar5 == 0) {
				os_printf_plus("Ce\n");
			}
			else if (bVar1 == 0) {
				memcpy(info.sta_mac,g_ic.ic_profile.mac_bakup,6);
				os_printf_plus("Load\n");
			}
		}
		else {
			if (iVar5 == -1) {
				info.sta_mac[0] = '\\';
				info.sta_mac[1] = 0xcf;
				info.sta_mac[2] = '\x7f';
			}
			memcpy(g_ic.ic_profile.mac_bakup,info.sta_mac,6);
			os_printf_plus("Backup default %d\n",iVar5);
			system_save_sys_param();
		}
	}
	wifi_set_backup_mac(info.sta_mac);
	wifi_softap_cacl_mac(info.softap_mac, info.sta_mac);
	info.softap_info.ip.addr = 0x104a8c0; /* 192.168.4.1 */
	info.softap_info.gw.addr = 0x104a8c0;
	info.softap_info.netmask.addr = 0xffffff;
	DPRINTF("ets_timer_init\n");
	ets_timer_init();
	DPRINTF("lwip_init\n");
	lwip_init();
	espconn_init();
	lwip_timer_interval = 25; /* 25ms */
	ets_timer_setfn(&check_timeouts_timer,sys_check_timeouts,0);
	DPRINTF("user_init_default_profile\n");
	user_init_default_profile();
	if ((DPORT->PERI_IO_SWAP & 1) == 0) {
		system_uart_de_swap();
	} else {
		system_uart_swap();
	}
	uVar6 = RTC->STORE[0];
	while ((UART0->STATUS & 0xff0000) != 0);
	while ((UART1->STATUS & 0xff0000) != 0);
	IOMUX->GPIO0 &= 0xfffffeff;  /* Switch from CLK_OUT to GPIO */
	IOMUX->GPIO2 &= 0xfffffeff;  /* Switch from U0TXD_BK to GPIO */
	system_rtc_mem_read(0,&rst_if,0x1c);
	if (uVar6 == 0) {
		uVar6 = rtc_get_reset_reason();
		if (uVar6 == 1) {
			memset(&rst_if,0,0x1c);
		}
		else {
			uVar6 = rtc_get_reset_reason();
			if (uVar6 == 2) {
				if (((rst_if.reason != REASON_DEEP_SLEEP_AWAKE) || (rst_if.epc1 != 0)) || (rst_if.excvaddr != 0)) {
					memset(&rst_if,0,0x1c);
					rst_if.reason = REASON_EXT_SYS_RST;
				}
			}
			else {
				rtc_get_reset_reason();
			}
		}
	}
	else if (6 < uVar6) {
		memset(&rst_if,0,0x1c);
	}
	system_rtc_mem_write(0,&rst_if,0x1c);
	DPRINTF("read phy and rf cal data\n");
	phy_rf_data = os_zalloc_dram(sizeof(*phy_rf_data));
	spi_flash_read(flashchip->sector_size * system_phy_init_sector,(void*)phy_rf_data,0x80);
	rf_cal_data = (void*)&phy_rf_data->rf_cal;
	spi_flash_read(flashchip->sector_size * system_rf_cal_sector,(void*)rf_cal_data,0x274);
	phy_rx_gain_dc_table = phy_rf_data->rf_cal.rx_gain_dc_table;
	iVar5 = flash_data_check(rf_cal_data);
	if ((iVar5 == 0) && (iVar5 = phy_check_data_table(phy_rx_gain_dc_table,0x7d,1), iVar5 == 0)) {
		bVar3 = false;
	}
	else {
		bVar3 = true;
	}
	if (rst_if.reason != REASON_DEEP_SLEEP_AWAKE) {
		phy_afterwake_set_rfoption(1);
	}
	if ((rst_if.reason != REASON_DEEP_SLEEP_AWAKE) && (!bVar3)) {
		write_data_to_rtc(rf_cal_data);
	}
	if (phy_rf_data->esp_init.param_ver_id == '\x05') {
		cVar9 = '\v';
		cVar2 = phy_rf_data->esp_init.freq_offset;
		if (freq_trace_enable == false) {
			uVar6 = phy_rf_data->esp_init._112;
			if (((uVar6 < 2) && (-1 < (int)uVar6)) || (uVar6 == 3)) {
LAB_4022f98c:
				phy_rf_data->esp_init._112 = '\0';
			}
			else {
				cVar9 = '\a';
				if (uVar6 == 5) {
					if (-1 < cVar2) {
						if (cVar2 < '\a') {
							cVar9 = '\0';
							phy_rf_data->esp_init.freq_offset = '\0';
						}
						else {
							cVar9 = '\x05';
						}
					}
				}
				else if (uVar6 == 7) {
					if (-1 < cVar2) {
						cVar9 = '\0';
						phy_rf_data->esp_init.freq_offset = '\0';
					}
				}
				else if (uVar6 == 9) {
					if (-1 < cVar2) {
						if (cVar2 < '\a') {
							cVar9 = '\0';
							phy_rf_data->esp_init.freq_offset = '\0';
						}
						else {
							cVar9 = '\x05';
						}
					}
				}
				else {
					if (uVar6 != 0xb) goto LAB_4022f98c;
					if (-1 < cVar2) {
						cVar9 = '\0';
						phy_rf_data->esp_init.freq_offset = '\0';
					}
				}
				phy_rf_data->esp_init._112 = cVar9;
			}
		}
		else if (freq_trace_enable == true) {
			bVar1 = phy_rf_data->esp_init._112;
			cVar8 = '\x03';
			if ((1 < bVar1) && (bVar1 != 3)) {
				if (bVar1 == 5) {
					cVar8 = cVar9;
					if ((-1 < cVar2) && (cVar8 = '\t', cVar2 < '\a')) {
						phy_rf_data->esp_init.freq_offset = '\0';
						cVar8 = '\x03';
					}
				}
				else if (bVar1 == 7) {
					cVar8 = cVar9;
					if (-1 < cVar2) {
						phy_rf_data->esp_init.freq_offset = '\0';
						cVar8 = '\x03';
					}
				}
				else if (bVar1 == 9) {
					cVar8 = cVar9;
					if (-1 < cVar2) {
						if (cVar2 < '\a') {
							phy_rf_data->esp_init.freq_offset = '\0';
							cVar8 = '\x03';
						}
						else {
							cVar8 = '\t';
						}
					}
				}
				else if ((bVar1 == 0xb) && (cVar8 = cVar9, -1 < cVar2)) {
					phy_rf_data->esp_init.freq_offset = '\0';
					cVar8 = '\x03';
				}
			}
			phy_rf_data->esp_init._112 = cVar8;
		}
		chip_init(&phy_rf_data->esp_init, info.sta_mac);  /* resets clocks, so re-init uart */
	}
	else {
		os_printf_plus("rf_cal[0] !=0x05,is 0x%02X\n");
		ets_delay_us(10000);
		system_restart_local();
	}
	g_ic.phy_function = (phy_rf_data->esp_init._112 & 5U) == 1;
	os_printf_plus("rf cal sector: %d\n",system_rf_cal_sector);
	os_printf_plus("freq trace enable %d\n",freq_trace_enable);
	os_printf_plus("rf[112] : %02x\n", phy_rf_data->esp_init._112);
	os_printf_plus("rf[113] : %02x\n", phy_rf_data->esp_init.freq_offset);
	os_printf_plus("rf[114] : %02x\n", phy_rf_data->esp_init._114);
	if ((bVar3) &&
		 (((rst_if.reason != REASON_DEEP_SLEEP_AWAKE && (uVar6 = rtc_get_reset_reason(), uVar6 == 2)) ||
			(uVar6 = rtc_get_reset_reason(), uVar6 == 1)))) {
		os_printf_plus("w_flash\n");
		get_data_from_rtc(rf_cal_data);
		wifi_param_save_protect_with_check(
			system_rf_cal_sector,
			flashchip->sector_size,
			rf_cal_data,
			0x274);
	}
	vPortFree(phy_rf_data,"app_main.c",0x53b);
	os_printf_plus("\nSDK ver: %s compiled @ Oct	9 2021 09:52:05\n",
		"3.0.5(b29dcd3)");
	uint32_t phy_ver = RTCMEM->BACKUP[0x7c/4];
	uint32_t pp_ver = RTCMEM->SYSTEM[0xf8/4];
	os_printf_plus("phy ver: %d_%d, pp ver: %d.%d\n\n",
		(phy_ver >> 0x10) & 0xfff, phy_ver >> 0x1c,
		(pp_ver & 0xff00) >> 8, pp_ver & 0xff);
	if ((g_ic.phy_function & 1) != 0) {
		uint32_t freq_cal = RTCMEM->BACKUP[0x78/4];
		if (rst_if.reason == REASON_DEEP_SLEEP_AWAKE) {
			TestStaFreqCalValInput = freq_cal >> 0x10;
			chip_v6_set_chan_offset(1, TestStaFreqCalValInput);
			TestStaFreqCalValDev = TestStaFreqCalValInput;
		}
		else {
			TestStaFreqCalValInput = 0;
			RTCMEM->BACKUP[0x78/4] = freq_cal & 0xffff;
		}
	}
	system_rtc_mem_write(0,pv,0x1c);
	vPortFree(pv,"app_main.c",0x571);
	wdt_init(true);
	user_init();
	ets_timer_disarm(&check_timeouts_timer);
	ets_timer_arm_new(&check_timeouts_timer,lwip_timer_interval,1,1);
	uVar4 = g_ic.ic_profile.opmode;
	WDT->RST = 0x73;  /* WDT_FEED() */
	user_init_flag = 1;

